coocox/Mplib/Toshaba/TMPM36x/TMPM366/cmsis_lib/lib/source/tmpm366_dmac.c
    tmp <<= (uint32_t) Chx;
    if (INTSource == DMAC_INT_TX_END) {
        DMACx->INTTCCLEAR = tmp;
    } else {
        DMACx->INTERRCLR = tmp;
    }
}

/**
  * @brief  Get the specified DMA Channel transfer raw interrupt request state.
  * @param  Chx: Select DMA channel
  *   This parameter can be one of the following values:
  *   DMAC_CHANNEL_0 or DMAC_CHANNEL_1
  * @retval The request state of DMA transfer raw interrupt
  *   This parameter can be one of the following values:
  *   DMAC_TX_NO_REQ, DMAC_TX_END_REQ, DMAC_TX_ERR_REQ or DMAC_TX_REQS
  */
DMAC_TxINTReq DMAC_GetRawTxINTReq(TSB_DMAC_TypeDef * DMACx, DMAC_Channel Chx)
{
    uint8_t tmp0 = 0U;
    uint8_t tmp1 = 0U;
    uint8_t mask = 1U;
    DMAC_TxINTReq retval = DMAC_TX_NO_REQ;

    /* Check the parameters */
    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL(Chx));

    mask <<= (uint32_t) Chx;
    tmp0 = (uint8_t) (DMACx->RAWINTTCSTATUS & mask);
    tmp1 = (uint8_t) (DMACx->RAWINTERRORSTATUS & mask) << 1U;
    tmp1 = tmp0 | tmp1;

    if (Chx == DMAC_CHANNEL_1) {
        tmp1 >>= 1U;
    } else {
        /* Do nothing */
    }

    switch (tmp1) {
    case DMAC_TX_END_REQ:      /* Check transfer end interrupt request flag */
        /* Transfer end interrupt request */
        retval = DMAC_TX_END_REQ;
        break;
    case DMAC_TX_ERR_REQ:      /* Check transfer error interrupt request flag */
        /* Transfer error interrupt request */
        retval = DMAC_TX_ERR_REQ;
        break;
    case DMAC_TX_REQS:
        /* More than one request */
        retval = DMAC_TX_REQS;
        break;
    default:
        /* Do nothing */
        break;
    }

    return retval;
}

/**
  * @brief  Get the specified DMA Channel transfer state.
  * @param  Chx: Select DMA channel
  *   This parameter can be one of the following values:
  *   DMAC_CHANNEL_0 or DMAC_CHANNEL_1
  * @retval The DMA transfer status.
  *   The value returned can be one of the followings:
  *   BUSY or DONE.
  */
WorkState DMAC_GetChannelTxState(TSB_DMAC_TypeDef * DMACx, DMAC_Channel Chx)
{
    uint32_t tmp = 0U;
    WorkState retval = BUSY;

    /* Check the parameters */
    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL(Chx));

    tmp = DMACx->ENBLDCHNS;
    tmp >>= (uint32_t) Chx;

    if ((tmp & ENBLDCHNS_CH_FLAG) == 0U) {
        /* Return transfer completed if the flag is clear */
        retval = DONE;
    } else {
        /* Do nothing */
    }

    return retval;
}

/**
  * @brief  Set DMA burst transfer requests by software.
  * @param  BurstReq: Select burst request number.
  *   This parameter can one of the following values:
  *   DMACA_SIO0_UART0_RX, DMACA_SIO0_UART0_TX, DMACA_SIO1_UART1_RX, DMACA_SIO1_UART1_TX, 
  *   DMACA_TMRB8_CMP_MATCH, DMACA_TMRB9_CMP_MATCH, DMACA_TMRB0_CAPTURE0, DMACA_TMRB4_CAPTURE0, 
  *   DMACA_TMRB4_CAPTURE1, DMACA_TMRB5_CAPTURE0, DMACA_TMRB5_CAPTURE1, DMACA_TOP_PRIORITY_ADC,
  *   DMACA_FULL_UART_RX, DMACA_FULL_UART_TX
  * @retval None
  */
void DMACA_SetSWBurstReq(DMACA_ReqNum BurstReq)
{
    uint32_t tmp = 0U;
    uint32_t mask = 1U;

    /* Check the parameters */
    assert_param(IS_DMACA_BURST_REQ_NUM(BurstReq));

    tmp = TSB_DMACA->SOFTBREQ;
    mask <<= ((uint32_t) BurstReq);
    tmp &= ~mask;
    tmp &= (uint32_t) DMACA_SOFTBREQ_MASK;
    mask = 1U;
    tmp |= (uint32_t) (mask << BurstReq);
    /* Set DMA software burst request */
    TSB_DMACA->SOFTBREQ = tmp;
}

/**
  * @brief  Set DMA burst transfer requests by software.
  * @param  BurstReq: Select burst request number.
  *   This parameter can one of the following values:
  *   DMACB_TMRB6_CMP_MATCH, DMACB_TMRB7_CMP_MATCH, DMACB_TMRB0_CAPTURE1, DMACB_TMRB2_CAPTURE0, 
  *   DMACB_TMRB2_CAPTURE1, DMACB_TMRB3_CAPTURE0, DMACB_TMRB3_CAPTURE1, DMACB_TMRB6_CAPTURE0, 
  *   DMACB_TMRB6_CAPTURE1, DMACB_NORMAL_ADC, DMACB_SSP0_TX, DMACB_SSP0_RX, 
  *   DMACB_SSP1_TX, DMACB_SSP1_RX, DMACB_SSP2_TX, DMACB_SSP2_RX
  * @retval None
  */
void DMACB_SetSWBurstReq(DMACB_ReqNum BurstReq)
{
    uint32_t tmp = 0U;
    uint32_t mask = 1U;

    /* Check the parameters */
    assert_param(IS_DMACB_BURST_REQ_NUM(BurstReq));

    tmp = TSB_DMACB->SOFTBREQ;
    mask <<= ((uint32_t) BurstReq);
    tmp &= ~mask;
    tmp &= (uint32_t) DMACB_SOFTBREQ_MASK;
    mask = 1U;
    tmp |= (uint32_t) (mask << BurstReq);
    /* Set DMA software burst request */
    TSB_DMACB->SOFTBREQ = tmp;
}

/**
  * @brief  Get DMA software burst request state.
  * @param  None
  * @retval The DMA burst request status.
  */
DMAC_BurstReqState DMAC_GetSWBurstReqState(TSB_DMAC_TypeDef * DMACx)
{
    DMAC_BurstReqState tmp = { 0U };
    /* Check the parameters */
    assert_param(IS_DMAC_UNIT(DMACx));

    /* Get DMA burst request status */
    tmp.All = DMACx->SOFTBREQ;
    if (TSB_DMACA == DMACx) {
        tmp.All &= DMACA_SOFTBREQ_MASK;
    } else {
        tmp.All &= DMACB_SOFTBREQ_MASK;
    }

    return tmp;
}

/**
  * @brief  Set DMA single transfer requests by software.
  * @param  SingleReq: Select single request number.
  *   This parameter can one of the following values:
  *   DMAC_SSP0_RX, DMAC_SSP1_RX
  * @retval None
  */
void DMACA_SetSWSingleReq(DMACA_ReqNum SingleReq)
{
    uint32_t tmp = 0U;
    uint32_t mask = 1U;

    /* Check the parameters */
    assert_param(IS_DMACA_SINGLE_REQ_NUM(SingleReq));

    tmp = TSB_DMACA->SOFTSREQ;
    mask <<= ((uint32_t) SingleReq);
    tmp &= ~mask;
    tmp &= (uint32_t) DMACA_SOFTSREQ_MASK;
    mask = 1U;
    tmp |= (uint32_t) mask << SingleReq;
    /* Set DMA software single request */
    TSB_DMACA->SOFTSREQ = tmp;
}

/**
  * @brief  Set DMA single transfer requests by software.
  * @param  SingleReq: Select single request number.
  *   This parameter can one of the following values:
  *   DMAC_SSP0_RX, DMAC_SSP1_RX
  * @retval None
  */
void DMACB_SetSWSingleReq(DMACB_ReqNum SingleReq)
{
    uint32_t tmp = 0U;
    uint32_t mask = 1U;

    /* Check the parameters */
    assert_param(IS_DMACB_SINGLE_REQ_NUM(SingleReq));

    tmp = TSB_DMACB->SOFTSREQ;
    mask <<= ((uint32_t) SingleReq);
    tmp &= ~mask;
    tmp &= (uint32_t) DMACB_SOFTSREQ_MASK;
    mask = 1U;
    tmp |= (uint32_t) mask << SingleReq;
    /* Set DMA software single request */
    TSB_DMACB->SOFTSREQ = tmp;
}

/**
  * @brief  Get DMA software single request state.
  * @param  None
  * @retval The DMA single request status.
  */
DMAC_SingleReqState DMAC_GetSWSingleReqState(TSB_DMAC_TypeDef * DMACx)
{
    DMAC_SingleReqState tmp = { 0U };

    /* Check the parameters */
    assert_param(IS_DMAC_UNIT(DMACx));

    /* Get DMA single request status */
    tmp.All = DMACx->SOFTSREQ;
    if (TSB_DMACA == DMACx) {
        tmp.All &= DMACA_SOFTSREQ_MASK;
    } else {
        tmp.All &= DMACB_SOFTSREQ_MASK;
    }

    return tmp;
}

/**
  * @brief  Set specified DMA Channel Linked List Item Register.
  * @param  Chx: Select DMA channel
  *   This parameter can be one of the following values:
  *   DMAC_CHANNEL_0 or DMAC_CHANNEL_1
  * @param  LinkedAddr: The start address of the next transfer information.
  *   Max 0xFFFFFFF0
  * @retval None
  */
void DMAC_SetLinkedList(TSB_DMAC_TypeDef * DMACx, DMAC_Channel Chx, uint32_t LinkedAddr)
{
    /* Check the parameters */
    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_DMAC_CHANNEL(Chx));
    assert_param(IS_DMAC_LINK_ADDR_MAX_VALUE(LinkedAddr));

    LinkedAddr &= DMAC_LLI_MASK;

