coocox/Mplib/Toshaba/TMPM36x/TMPM366/cmsis_lib/lib/source/tmpm366_dmac.c
        DMACx->C0CONFIGURATION = tmp;
        break;
    case DMAC_CHANNEL_1:
        tmp = DMACx->C1CONFIGURATION;
        tmp &= CXCONFIGURATION_E_CLEAR;

        if (NewState == ENABLE) {
            tmp |= CXCONFIGURATION_E_SET;
        } else {
            /* Do nothing */
        }

        DMACx->C1CONFIGURATION = tmp;
        break;
    default:
        /* Do nothing */
        break;
    }
}

/**
  * @brief  Initialize the specified DMA channel.
  * @param  Chx: Select DMA channel.
  *   This parameter can be one of the following values:
  *   DMAC_CHANNEL_0 or DMAC_CHANNEL_1
  * @param  InitStruct: The structure containing basic DMA configuration.
  * @retval None
  */
void DMAC_Init(TSB_DMAC_TypeDef * DMACx, DMAC_Channel Chx, DMAC_InitTypeDef * InitStruct)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_DMAC_UNIT(DMACx));
    assert_param(IS_POINTER_NOT_NULL(InitStruct));
    assert_param(IS_DMAC_CHANNEL(Chx));
    assert_param(IS_DMAC_TX_DIRECTION(InitStruct->TxDirection));
    assert_param(IS_FUNCTIONAL_STATE(InitStruct->SrcIncrementState));
    assert_param(IS_FUNCTIONAL_STATE(InitStruct->DstIncrementState));
    assert_param(IS_DMAC_BIT_WIDTH(InitStruct->SrcBitWidth));
    assert_param(IS_DMAC_BIT_WIDTH(InitStruct->DstBitWidth));
    assert_param(IS_DMAC_BURST_SIZE(InitStruct->SrcBurstSize));
    assert_param(IS_DMAC_BURST_SIZE(InitStruct->DstBurstSize));
    assert_param(IS_DMAC_TX_SIZE(InitStruct->TxSize));

    switch (InitStruct->TxDirection) {
    case DMAC_MEMORY_TO_PERIPH:
        if (TSB_DMACA == DMACx) {
            assert_param(IS_DMACA_REQ_NUM(InitStruct->A_TxDstPeriph));
        } else {
            assert_param(IS_DMACB_REQ_NUM(InitStruct->B_TxDstPeriph));
        }
        break;
    case DMAC_PERIPH_TO_MEMORY:
        if (TSB_DMACA == DMACx) {
            assert_param(IS_DMACA_REQ_NUM(InitStruct->A_TxSrcPeriph));
        } else {
            assert_param(IS_DMACB_REQ_NUM(InitStruct->B_TxSrcPeriph));
        }
        break;
    case DMAC_PERIPH_TO_PERIPH:
        if (TSB_DMACA == DMACx) {
            assert_param(IS_DMACA_REQ_NUM(InitStruct->A_TxDstPeriph));
            assert_param(IS_DMACA_REQ_NUM(InitStruct->A_TxSrcPeriph));
        } else {
            assert_param(IS_DMACB_REQ_NUM(InitStruct->B_TxDstPeriph));
            assert_param(IS_DMACB_REQ_NUM(InitStruct->B_TxSrcPeriph));
        }
        break;
    default:
        /*Do nothing */
        break;
    }

    assert_param(IS_FUNCTIONAL_STATE(InitStruct->TxINT));

    if (Chx == DMAC_CHANNEL_0) {
        /* Set DMA source address */
        DMACx->C0SRCADDR = InitStruct->SrcAddr;
        /* Set DMA destination address */
        DMACx->C0DESTADDR = InitStruct->DstAddr;

        /* Initialize DMA CxCONTROL register */
        tmp = DMACx->C0CONTROL;
        tmp &= CXCONTROL_INIT_MASK;
        tmp |= InitStruct->TxSize | (uint32_t) InitStruct->SrcIncrementState << 26U |
            (uint32_t) InitStruct->DstIncrementState << 27U |
            (uint32_t) InitStruct->SrcBitWidth << 18U |
            (uint32_t) InitStruct->DstBitWidth << 21U |
            (uint32_t) InitStruct->SrcBurstSize << 12U |
            (uint32_t) InitStruct->DstBurstSize << 15U | (uint32_t) InitStruct->TxINT << 31U;
        DMACx->C0CONTROL = tmp;

        /* Initialize DMA CxCONFIGURATION register */
        tmp = DMACx->C0CONFIGURATION;
        tmp &= CXCONFIGURATION_INIT_MASK;
        tmp |= InitStruct->TxDirection;

        switch (InitStruct->TxDirection) {
        case DMAC_MEMORY_TO_PERIPH:
            if (DMACx == TSB_DMACA) {
                tmp |= (uint32_t) InitStruct->A_TxDstPeriph << 6U;
            } else {
                tmp |= (uint32_t) InitStruct->B_TxDstPeriph << 6U;
            }
            break;
        case DMAC_PERIPH_TO_MEMORY:
            if (DMACx == TSB_DMACA) {
                tmp |= (uint32_t) InitStruct->A_TxSrcPeriph << 1U;
            } else {
                tmp |= (uint32_t) InitStruct->B_TxSrcPeriph << 1U;
            }
            break;
        case DMAC_PERIPH_TO_PERIPH:
            if (DMACx == TSB_DMACA) {
                tmp |= (uint32_t) InitStruct->A_TxDstPeriph << 6U;
                tmp |= (uint32_t) InitStruct->A_TxSrcPeriph << 1U;
            } else {
                tmp |= (uint32_t) InitStruct->B_TxDstPeriph << 6U;
                tmp |= (uint32_t) InitStruct->B_TxSrcPeriph << 1U;
            }
            break;
        default:
            /* Do nothing */
            break;
        }

        DMACx->C0CONFIGURATION = tmp;
    } else {
        /* Set DMA source address */
        DMACx->C1SRCADDR = InitStruct->SrcAddr;
        /* Set DMA destination address */
        DMACx->C1DESTADDR = InitStruct->DstAddr;

        /* Initialize DMA CxCONTROL register */
        tmp = DMACx->C1CONTROL;
        tmp &= CXCONTROL_INIT_MASK;
        tmp |= InitStruct->TxSize | (uint32_t) InitStruct->SrcIncrementState << 26U |
            (uint32_t) InitStruct->DstIncrementState << 27U |
            (uint32_t) InitStruct->SrcBitWidth << 18U |
            (uint32_t) InitStruct->DstBitWidth << 21U |
            (uint32_t) InitStruct->SrcBurstSize << 12U |
            (uint32_t) InitStruct->DstBurstSize << 15U | (uint32_t) InitStruct->TxINT << 31U;
        DMACx->C1CONTROL = tmp;

        /* Initialize DMA CxCONFIGURATION register */
        tmp = DMACx->C1CONFIGURATION;
        tmp &= CXCONFIGURATION_INIT_MASK;
        tmp |= InitStruct->TxDirection;

        switch (InitStruct->TxDirection) {
        case DMAC_MEMORY_TO_PERIPH:
            if (DMACx == TSB_DMACA) {
                tmp |= (uint32_t) InitStruct->A_TxDstPeriph << 6U;
            } else {
                tmp |= (uint32_t) InitStruct->B_TxDstPeriph << 6U;
            }
            break;
        case DMAC_PERIPH_TO_MEMORY:
            if (DMACx == TSB_DMACA) {
                tmp |= (uint32_t) InitStruct->A_TxSrcPeriph << 1U;
            } else {
                tmp |= (uint32_t) InitStruct->B_TxSrcPeriph << 1U;
            }
            break;
        case DMAC_PERIPH_TO_PERIPH:
            if (DMACx == TSB_DMACA) {
                tmp |= (uint32_t) InitStruct->A_TxDstPeriph << 6U;
                tmp |= (uint32_t) InitStruct->A_TxSrcPeriph << 1U;
            } else {
                tmp |= (uint32_t) InitStruct->B_TxDstPeriph << 6U;
                tmp |= (uint32_t) InitStruct->B_TxSrcPeriph << 1U;
            }
            break;
        default:
            /* Do nothing */
            break;
        }

        DMACx->C1CONFIGURATION = tmp;
    }
}

/** @} */
/* End of group DMAC_Exported_Functions */

/** @} */
/* End of group DMAC */

/** @} */
/* End of group TX03_Periph_Driver */
#endif                          /* defined(__TMPM366_DMAC_H) */
